results/ycsb/4-nodes/6-clients/couchbase2/workloadc_couchbase_custom-validation2/results-20.txt
[OVERALL], RunTime(ms), 164980
[OVERALL], Throughput(ops/sec), 606.1340768578009
[TOTAL_GCS_G1_Young_Generation], Count, 71
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1040
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.630379439932113
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 71
[TOTAL_GC_TIME], Time(ms), 1040
[TOTAL_GC_TIME_%], Time(%), 0.630379439932113
[CLEANUP], Operations, 20
[CLEANUP], AverageLatency(us), 2.5
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 36
[CLEANUP], 0, 18.0
[CLEANUP], 1000, 0.42857142857142855
[CLEANUP], 2000, 0.8571428571428571
[CLEANUP], 3000, 1.25
[UPDATE], Operations, 5090
[UPDATE], AverageLatency(us), 5813.623968565816
[UPDATE], MinLatency(us), 201
[UPDATE], MaxLatency(us), 527034
[UPDATE], Return=OK, 5090
[UPDATE], 0, 33079.21428571428
[UPDATE], 1000, 18427.882352941175
[UPDATE], 2000, 8887.264705882353
[UPDATE], 3000, 9270.75
[UPDATE], 4000, 7637.45
[UPDATE], 5000, 7827.72972972973
[UPDATE], 6000, 8764.064516129032
[UPDATE], 7000, 7002.622222222222
[UPDATE], 8000, 11122.371428571429
[UPDATE], 9000, 6647.866666666667
[UPDATE], 10000, 10622.344827586207
[UPDATE], 11000, 8057.527777777777
[UPDATE], 12000, 9177.896551724138
[UPDATE], 13000, 5340.9473684210525
[UPDATE], 14000, 6674.941176470588
[UPDATE], 15000, 4181.025
[UPDATE], 16000, 7995.644444444444
[UPDATE], 17000, 6379.444444444444
[UPDATE], 18000, 11829.6
[UPDATE], 19000, 9737.315789473685
[UPDATE], 20000, 5532.547619047619
[UPDATE], 21000, 6137.96
[UPDATE], 22000, 5061.085714285714
[UPDATE], 23000, 5329.416666666667
[UPDATE], 24000, 5224.882352941177
[UPDATE], 25000, 3928.064516129032
[UPDATE], 26000, 7147.529411764706
[UPDATE], 27000, 4818.75
[UPDATE], 28000, 5505.277777777777
[UPDATE], 29000, 6389.541666666667
[UPDATE], 30000, 3883.7027027027025
[UPDATE], 31000, 3790.0731707317073
[UPDATE], 32000, 4117.108695652174
[UPDATE], 33000, 4984.837209302325
[UPDATE], 34000, 5551.275862068966
[UPDATE], 35000, 4646.302325581395
[UPDATE], 36000, 5232.888888888889
[UPDATE], 37000, 4540.645161290323
[UPDATE], 38000, 5365.619047619048
[UPDATE], 39000, 4296.05
[UPDATE], 40000, 4590.275862068966
[UPDATE], 41000, 4456.466666666666
[UPDATE], 42000, 4755.473684210527
[UPDATE], 43000, 5743.925925925926
[UPDATE], 44000, 4269.689655172414
[UPDATE], 45000, 4722.666666666667
[UPDATE], 46000, 5120.666666666667
[UPDATE], 47000, 4155.193548387097
[UPDATE], 48000, 4959.972222222223
[UPDATE], 49000, 9520.076923076924
[UPDATE], 50000, 4096.807692307692
[UPDATE], 51000, 5851.285714285715
[UPDATE], 52000, 8887.375
[UPDATE], 53000, 5707.736842105263
[UPDATE], 54000, 6097.65
[UPDATE], 55000, 15074.625
[UPDATE], 56000, 6001.25
[UPDATE], 57000, 5663.0
[UPDATE], 58000, 4648.28
[UPDATE], 59000, 5629.625
[UPDATE], 60000, 9299.47619047619
[UPDATE], 61000, 5239.617647058823
[UPDATE], 62000, 4407.548387096775
[UPDATE], 63000, 8101.611111111111
[UPDATE], 64000, 4142.461538461538
[UPDATE], 65000, 2988.6190476190477
[UPDATE], 66000, 3859.4848484848485
[UPDATE], 67000, 3122.6666666666665
[UPDATE], 68000, 3909.1111111111113
[UPDATE], 69000, 5013.576923076923
[UPDATE], 70000, 6370.1612903225805
[UPDATE], 71000, 4798.441176470588
[UPDATE], 72000, 3355.1612903225805
[UPDATE], 73000, 6647.9473684210525
[UPDATE], 74000, 4551.764705882353
[UPDATE], 75000, 7043.789473684211
[UPDATE], 76000, 4131.5161290322585
[UPDATE], 77000, 4255.510204081633
[UPDATE], 78000, 3437.074074074074
[UPDATE], 79000, 7715.103448275862
[UPDATE], 80000, 5498.5
[UPDATE], 81000, 6059.62962962963
[UPDATE], 82000, 5518.375
[UPDATE], 83000, 3539.575
[UPDATE], 84000, 4418.102564102564
[UPDATE], 85000, 8612.90909090909
[UPDATE], 86000, 5582.6
[UPDATE], 87000, 4936.782608695652
[UPDATE], 88000, 4330.571428571428
[UPDATE], 89000, 5132.272727272727
[UPDATE], 90000, 3730.3333333333335
[UPDATE], 91000, 4813.351351351352
[UPDATE], 92000, 51402.393939393936
[UPDATE], 93000, 4381.777777777777
[UPDATE], 94000, 4342.470588235294
[UPDATE], 95000, 3892.0666666666666
[UPDATE], 96000, 4344.323529411765
[UPDATE], 97000, 3890.6071428571427
[UPDATE], 98000, 7165.074074074074
[UPDATE], 99000, 8659.90909090909
[UPDATE], 100000, 8604.037037037036
[UPDATE], 101000, 5140.04347826087
[UPDATE], 102000, 6478.111111111111
[UPDATE], 103000, 4077.088888888889
[UPDATE], 104000, 5733.3
[UPDATE], 105000, 4750.833333333333
[UPDATE], 106000, 6014.964285714285
[UPDATE], 107000, 5116.775
[UPDATE], 108000, 4311.733333333334
[UPDATE], 109000, 3890.0
[UPDATE], 110000, 3380.7916666666665
[UPDATE], 111000, 3726.4285714285716
[UPDATE], 112000, 5211.642857142857
[UPDATE], 113000, 4204.482758620689
[UPDATE], 114000, 8613.68888888889
[UPDATE], 115000, 6335.047619047619
[UPDATE], 116000, 3866.2
[UPDATE], 117000, 3746.595238095238
[UPDATE], 118000, 10906.204545454546
[UPDATE], 119000, 3730.9411764705883
[UPDATE], 120000, 5590.423076923077
[UPDATE], 121000, 6851.5
[UPDATE], 122000, 3653.0
[UPDATE], 123000, 5658.682926829269
[UPDATE], 124000, 4261.282051282052
[UPDATE], 125000, 4354.205882352941
[UPDATE], 126000, 5853.972972972973
[UPDATE], 127000, 5606.391304347826
[UPDATE], 128000, 5242.048780487805
[UPDATE], 129000, 5032.176470588235
[UPDATE], 130000, 3432.375
[UPDATE], 131000, 9369.714285714286
[UPDATE], 132000, 3981.840909090909
[UPDATE], 133000, 4911.375
[UPDATE], 134000, 2808.205882352941
[UPDATE], 135000, 4438.851851851852
[UPDATE], 136000, 4331.862068965517
[UPDATE], 137000, 4712.551724137931
[UPDATE], 138000, 4512.384615384615
[UPDATE], 139000, 4469.542857142857
[UPDATE], 140000, 3474.675675675676
[UPDATE], 141000, 4316.681818181818
[UPDATE], 142000, 4247.074074074074
[UPDATE], 143000, 5032.807692307692
[UPDATE], 144000, 3790.45
[UPDATE], 145000, 5541.351351351352
[UPDATE], 146000, 4467.130434782609
[UPDATE], 147000, 4941.181818181818
[UPDATE], 148000, 4197.151515151515
[UPDATE], 149000, 6483.666666666667
[UPDATE], 150000, 5182.717948717948
[UPDATE], 151000, 3417.0714285714284
[UPDATE], 152000, 4947.195652173913
[UPDATE], 153000, 3897.2162162162163
[UPDATE], 154000, 2497.5263157894738
[UPDATE], 155000, 3477.511111111111
[UPDATE], 156000, 5140.184210526316
[UPDATE], 157000, 4283.2
[UPDATE], 158000, 5033.903225806452
[UPDATE], 159000, 3319.24
[UPDATE], 160000, 3097.0
[UPDATE], 161000, 1530.5
[SCAN], Operations, 94910
[SCAN], AverageLatency(us), 33653.21609946265
[SCAN], MinLatency(us), 1199
[SCAN], MaxLatency(us), 1897629
[SCAN], Return=OK, 94910
[SCAN], 0, 151613.90235690237
[SCAN], 1000, 46490.01401869159
[SCAN], 2000, 32227.480263157893
[SCAN], 3000, 30244.892575039496
[SCAN], 4000, 26846.173970783533
[SCAN], 5000, 29208.428790199083
[SCAN], 6000, 32066.956043956045
[SCAN], 7000, 29054.308605341248
[SCAN], 8000, 34028.51277372263
[SCAN], 9000, 34488.82450331126
[SCAN], 10000, 42336.233409610984
[SCAN], 11000, 38380.619402985074
[SCAN], 12000, 34917.422066549916
[SCAN], 13000, 28113.333333333332
[SCAN], 14000, 27434.42032967033
[SCAN], 15000, 25315.663198959686
[SCAN], 16000, 31224.235478806906
[SCAN], 17000, 29237.49626307922
[SCAN], 18000, 44789.193396226416
[SCAN], 19000, 48011.12993039443
[SCAN], 20000, 26817.439946018894
[SCAN], 21000, 34760.25754884547
[SCAN], 22000, 30945.394777265745
[SCAN], 23000, 32186.972927241964
[SCAN], 24000, 33694.87456445993
[SCAN], 25000, 35958.77319587629
[SCAN], 26000, 36808.300187617264
[SCAN], 27000, 25576.893129770993
[SCAN], 28000, 29281.495562130178
[SCAN], 29000, 28243.03901734104
[SCAN], 30000, 32451.99836333879
[SCAN], 31000, 26922.12208504801
[SCAN], 32000, 27105.658142664874
[SCAN], 33000, 26717.72067039106
[SCAN], 34000, 28341.49431818182
[SCAN], 35000, 31696.10664605873
[SCAN], 36000, 50351.45478036176
[SCAN], 37000, 29692.56656346749
[SCAN], 38000, 35944.87012987013
[SCAN], 39000, 41167.62645914397
[SCAN], 40000, 34706.85361552028
[SCAN], 41000, 34821.61896551724
[SCAN], 42000, 44585.881012658225
[SCAN], 43000, 39200.753982300885
[SCAN], 44000, 28633.415094339623
[SCAN], 45000, 27853.71833084948
[SCAN], 46000, 35688.899115044245
[SCAN], 47000, 35226.09540034072
[SCAN], 48000, 30035.943396226416
[SCAN], 49000, 34952.40480591497
[SCAN], 50000, 38169.77425044092
[SCAN], 51000, 29592.129179331307
[SCAN], 52000, 29979.03215926493
[SCAN], 53000, 35850.0018018018
[SCAN], 54000, 34741.043630017455
[SCAN], 55000, 38597.311871227364
[SCAN], 56000, 44511.67608695652
[SCAN], 57000, 29800.976340694007
[SCAN], 58000, 33951.236928104576
[SCAN], 59000, 35535.68100358423
[SCAN], 60000, 34637.431542461
[SCAN], 61000, 36883.73283858998
[SCAN], 62000, 33894.123050259965
[SCAN], 63000, 57308.21022727273
[SCAN], 64000, 30163.407894736843
[SCAN], 65000, 30948.913235294116
[SCAN], 66000, 34358.962585034016
[SCAN], 67000, 30198.121684867394
[SCAN], 68000, 43541.08405172414
[SCAN], 69000, 43629.307875894985
[SCAN], 70000, 45041.145569620254
[SCAN], 71000, 32447.849427168578
[SCAN], 72000, 38382.681992337166
[SCAN], 73000, 39369.64562118126
[SCAN], 74000, 35172.84146341463
[SCAN], 75000, 43138.301310043666
[SCAN], 76000, 30262.293853073465
[SCAN], 77000, 25679.68308921438
[SCAN], 78000, 29505.676691729324
[SCAN], 79000, 45074.46031746032
[SCAN], 80000, 32286.434991974318
[SCAN], 81000, 40710.74385245902
[SCAN], 82000, 33957.01528013582
[SCAN], 83000, 26929.198639455783
[SCAN], 84000, 29549.054572271387
[SCAN], 85000, 43346.967661691546
[SCAN], 86000, 49094.770786516856
[SCAN], 87000, 42236.744136460555
[SCAN], 88000, 48626.16507177034
[SCAN], 89000, 47654.14536340852
[SCAN], 90000, 31474.280674846625
[SCAN], 91000, 32674.39408866995
[SCAN], 92000, 28411.00153846154
[SCAN], 93000, 23792.301188903566
[SCAN], 94000, 30937.74391988555
[SCAN], 95000, 22700.301714285713
[SCAN], 96000, 29480.973684210527
[SCAN], 97000, 37315.13211009174
[SCAN], 98000, 42264.39565217392
[SCAN], 99000, 34717.294117647056
[SCAN], 100000, 39157.02862985685
[SCAN], 101000, 39758.338345864664
[SCAN], 102000, 39573.80914512923
[SCAN], 103000, 34885.44947735192
[SCAN], 104000, 32072.48662207358
[SCAN], 105000, 32936.83440514469
[SCAN], 106000, 27811.13798008535
[SCAN], 107000, 26986.138166894663
[SCAN], 108000, 27126.327052489905
[SCAN], 109000, 26665.59005376344
[SCAN], 110000, 39903.51958762886
[SCAN], 111000, 41367.25153374233
[SCAN], 112000, 32243.354471544717
[SCAN], 113000, 28919.861812778603
[SCAN], 114000, 30492.174045801527
[SCAN], 115000, 42512.66448801743
[SCAN], 116000, 42144.64904862579
[SCAN], 117000, 32711.36038961039
[SCAN], 118000, 33425.05254237288
[SCAN], 119000, 37955.17365269461
[SCAN], 120000, 35748.201058201055
[SCAN], 121000, 33368.241908006814
[SCAN], 122000, 29557.13719512195
[SCAN], 123000, 32587.169781931465
[SCAN], 124000, 28553.283430232557
[SCAN], 125000, 25771.521072796935
[SCAN], 126000, 26516.9811827957
[SCAN], 127000, 36312.16570327553
[SCAN], 128000, 41765.43353783231
[SCAN], 129000, 31278.2816
[SCAN], 130000, 48413.961904761905
[SCAN], 131000, 46018.76346604215
[SCAN], 132000, 30100.8018018018
[SCAN], 133000, 35195.84107142857
[SCAN], 134000, 32660.03311258278
[SCAN], 135000, 40512.19191919192
[SCAN], 136000, 29770.96119402985
[SCAN], 137000, 43325.404867256635
[SCAN], 138000, 41125.493927125506
[SCAN], 139000, 34130.710801393725
[SCAN], 140000, 26362.41045751634
[SCAN], 141000, 31428.651347068146
[SCAN], 142000, 32734.979557069848
[SCAN], 143000, 34557.95652173913
[SCAN], 144000, 30982.042813455657
[SCAN], 145000, 34505.438721136765
[SCAN], 146000, 38726.47258979206
[SCAN], 147000, 44470.99311926605
[SCAN], 148000, 31325.12893081761
[SCAN], 149000, 38260.20303605313
[SCAN], 150000, 33226.23539232054
[SCAN], 151000, 27419.96690647482
[SCAN], 152000, 27355.88476821192
[SCAN], 153000, 28296.617604617604
[SCAN], 154000, 29356.633284241532
[SCAN], 155000, 26946.764864864865
[SCAN], 156000, 31462.73214285714
[SCAN], 157000, 30375.75
[SCAN], 158000, 36786.64854368932
[SCAN], 159000, 24846.88246628131
[SCAN], 160000, 25387.0
[SCAN], 161000, 10768.511811023622